app/controllers/notes_controller.rb

    def create
      @note = Note.new(note_params)
      if @note.save
---
INSERT INTO "notes" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "heg"], ["user_id", nil], ["created_at", "2023-10-15 07:02:56.898146"], ["updated_at", "2023-10-15 07:02:56.898146"]]

    def update
      if @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "hey1"], ["updated_at", "2023-10-15 07:14:55.652334"], ["id", 1]]